[{
	"name" : "Blademaster",

	"lore" : "Coming soon.",

	"ability" : {

		"1" : {

			"type" : "Passive",

			"name" : "Spirit Blade",

			"details" : "Every 3rd basic attack of Blademaster deals additional physical damage (scaling with physical power) and a Spirit Blade will spawn where Blademaster is.<br><br>Spirit Blade will stay for a while. Blademaster can pick up a Spirit Blade to gain increased movement speed that decays over time, and converts a small percentage of his next basic attack damage to true damage.<br><br>It is possible to pick up multiple Spirit Blades, but Blademaster can only use one for each basic attack (maximum 5 Spirit Blades)."

		},

		"2" : {

			"type" : "First Ability",

			"name" : "Condemn",

			"details" : "Blademaster&rsquo;s next basic attack within a few seconds deals additional physical damage (scaling with physical power).<br><br>When Blademaster kills an enemy with Condemn, half of the mana cost and cooldowns will be refunded.<br><br>In addition, a Spirit Blade will spawn on top of that unit."

		},

		"3" : {

			"type" : "Second Ability",

			"name" : "Blade Work",

			"details" : "Blademaster summons a Spirit Blade in a target location. Within a short while, Blademaster gains increased movement speed towards all the present Spirit Blades."

		},

		"4" : {

			"type" : "Third Ability",

			"name" : "Blade Surge",

			"details" : "Blademaster dashes to a Spirit Blade. Within a few seconds, Blademaster's next basic attack will dash to the target enemy, dealing physical damage (scaling with physical power) and granting himself increased attack speed for the next 3 basic attacks.<br><br>The attack speed boost lasts for a short while or until all 3 basic attacks are used."

		},

		"5" : {

			"type" : "Ultimate",

			"name" : "Blade Storm",

			"details" : "Blademaster briefly channels then dashes to a target location, dealing physical damage (scaling with physical power) to all enemies within the path.<br><br>In addition, all the Spirit Blades will return to him during the dash, dealing physical damage (scaling with physical power) to all enemies in the path and greatly slowing them for a very short duration."

		}

	}

}]