[{
	"name" : "War",

	"lore" : "Coming soon.",

	"ability" : {

		"1" : {

			"type" : "Passive",

			"name" : "Warborne",

			"details" : "Each time War takes or deals damage to enemy Hero, he gains a stack of Warborne for a short duration. Each stack of Warborne grants War increased life steal (maximum 10 stacks)."

		},

		"2" : {

			"type" : "First Ability",

			"name" : "Decimate",

			"details" : "War swings down his glaive in a target direction, dealing physical damage (scaling with physical power) to all enemies hit.<br><br>At maximum stacks of Warborne, Decimate will send out a flaming wave in the same target direction instead, reaching further and dealing more damage."

		},

		"3" : {

			"type" : "Second Ability",

			"name" : "Whirlwind",

			"details" : "War swings his glaive in front of him, blocking all projectiles from a target direction, except for ultimate and turret.<br><br>At maximum stacks of Warborne, War will weave his glaive around, blocking all projectiles from all directions instead while dealing physical damage (scaling with physical power)."

		},

		"4" : {

			"type" : "Third Ability",

			"name" : "Scorching Edge",

			"details" : "War enters a charging state when he drags his glaive in flame, gaining increased movement speed during the charge.<br><br>War can recast again to swing his glaive upward, dealing physical damage (scaling with physical power) to all enemies hit in a line and briefly slowing them.<br><br>If War charges for more than a while, he will deal more damage and will knock the enemies up before slowing them.<br><br>At maximum stacks of Warborne, War does not need to charge and will immediately cast Scorching Edge."

		},

		"5" : {

			"type" : "Ultimate",

			"name" : "Arena of Blood",

			"details" : "War picks a target enemy Hero, then slams down his glaive and creates an arena around him. Inside the arena, he instantly gains maximum stacks of Warborne.<br><br>Enemy heroes who try to walk out or into the arena will take physical damage (scaling with physical power) and become greatly slowed for a short duration."

		}

	}

}]